modules_cxf_src_test_java_org_mule_runtime_module_cxf_ProxyTestCase.java/[CN]/ProxyTestCase/[MT]/testProxyWithDatabinding()/body

{
  String msg="<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">" + "<soap:Body><greetMe xmlns=\"http://apache.org/hello_world_soap_http/types\"><requestType>Dan</requestType></greetMe>" + "</soap:Body>"+ "</soap:Envelope>";
  MuleClient client=muleContext.getClient();
  InternalMessage result=client.send("http://localhost:" + dynamicPort.getNumber() + "/services/greeter-databinding-proxy",InternalMessage.builder().payload(msg).build(),HTTP_REQUEST_OPTIONS).getRight();
  String resString=getPayloadAsString(result);
  assertTrue(resString.indexOf("greetMeResponse") != -1);
}
